index.org
#+TITLE: TROTER.JP
#+AUTHOR: Takumi IINO (troter)
#+EMAIL: takumi@timedia.co.jp, trot.thunder@gmail.com
#+LANGUAGE: ja

#+OPTIONS: ^:nil toc:nil
#+STYLE: <link rel="stylesheet" type="text/css" href="org-mode-document.css" />
#+HTML:<script type="text/javascript">
#+HTML:
#+HTML:  var _gaq = _gaq || [];
#+HTML:  _gaq.push(['_setAccount', 'UA-22731528-1']);
#+HTML:  _gaq.push(['_trackPageview']);
#+HTML:
#+HTML:  (function() {
#+HTML:    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
#+HTML:    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
#+HTML:    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
#+HTML:  })();
#+HTML:
#+HTML:</script>


* About
- Takumi IINO (a.k.a troter)
- Software Engineer
- Emacs, Ruby, PHP, Java

* Resource
- Twitter([[http://twitter.com/troter][@troter]])
 - [[http://twilog.org/troter][Twilog]]
- Hatena([[http://d.hatena.ne.jp/troter][id:troter]])
- Github([[https://github.com/troter][troter]])
- Bitbucket([[https://bitbucket.org/troter][troter]])

* Projects
- [[https://github.com/troter/tags-capture][tags-capture]] :: Simple capture library for JSP.
- [[https://github.com/troter/s2jdbc-custom-enum-type][s2jdbc-custom-enum-type]] :: Custom enum type support for S2JDBC.
- [[https://github.com/troter/s2jdbc-master-slave][s2jdbc-master-slave]] :: Master-Slave support for S2JDBC.
- [[https://github.com/troter/s2mai-oreo][s2mai-oreo]] :: S2Mai oreore extension.
- [[https://github.com/troter/log4j-rotate][log4j-rotate]] :: Log4j rotate file appender.
- [[https://bitbucket.org/troter/schema-update][schema-update]] :: Database schema migration tool.

** Maven Repository
- release  :: [[http://troter.jp/maven2/release]] @<br/> [[https://github.com/troter/troter.github.com/tree/master/maven2/release]]
- snapshot :: [[http://troter.jp/maven2/snapshots]] @<br/> [[https://github.com/troter/troter.github.com/tree/master/maven2/snapshots]]

* Publications
- [[./mercurial-cheatsheet][Mercurial チートシート]]
- [[./how-to-install-mercurial][Mercurialのインストール方法(SCMBC用資料)]]
- [[./timstudy-201110-memocurial-introduction][timstudy 201110 発表資料 Memocurialの紹介]]
