index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="ja" xml:lang="ja">
<head>
<title>TROTER.JP</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-10-26 19:35:23 "/>
<meta name="author" content="Takumi IINO (troter)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link rel="stylesheet" type="text/css" href="org-mode-document.css" />

</head>
<body>
<div id="content">

<h1 class="title">TROTER.JP</h1>


<script type="text/javascript">

var _gaq = _gaq || [];
_gaq.push(['_setAccount', 'UA-22731528-1']);
_gaq.push(['_trackPageview']);

(function() {
var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
})();

</script>



<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> About </h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>
Takumi IINO (a.k.a troter)
</li>
<li>
Software Engineer
</li>
<li>
Emacs, Ruby, PHP, Java

</li>
</ul>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Resource </h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>
Twitter(<a href="http://twitter.com/troter">@troter</a>)
<ul>
<li>
<a href="http://twilog.org/troter">Twilog</a>
</li>
</ul>
</li>
<li>
Hatena(<a href="http://d.hatena.ne.jp/troter">id:troter</a>)
</li>
<li>
Github(<a href="https://github.com/troter">troter</a>)
</li>
<li>
Bitbucket(<a href="https://bitbucket.org/troter">troter</a>)

</li>
</ul>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Projects </h2>
<div class="outline-text-2" id="text-3">

<dl>
<dt><a href="https://github.com/troter/tags-capture">tags-capture</a></dt><dd>
Simple capture library for JSP.
</dd>
<dt><a href="https://github.com/troter/s2jdbc-custom-enum-type">s2jdbc-custom-enum-type</a></dt><dd>
Custom enum type support for S2JDBC.
</dd>
<dt><a href="https://github.com/troter/s2jdbc-master-slave">s2jdbc-master-slave</a></dt><dd>
Master-Slave support for S2JDBC.
</dd>
<dt><a href="https://github.com/troter/s2mai-oreo">s2mai-oreo</a></dt><dd>
S2Mai oreore extension.
</dd>
<dt><a href="https://github.com/troter/log4j-rotate">log4j-rotate</a></dt><dd>
Log4j rotate file appender.
</dd>
<dt><a href="https://bitbucket.org/troter/schema-update">schema-update</a></dt><dd>
Database schema migration tool.

</dd>
</dl>

</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1"><span class="section-number-3">3.1</span> Maven Repository </h3>
<div class="outline-text-3" id="text-3.1">

<dl>
<dt>release </dt><dd>
<a href="http://troter.jp/maven2/release">http://troter.jp/maven2/release</a> <br/> <a href="https://github.com/troter/troter.github.com/tree/master/maven2/release">https://github.com/troter/troter.github.com/tree/master/maven2/release</a>
</dd>
<dt>snapshot</dt><dd>
<a href="http://troter.jp/maven2/snapshots">http://troter.jp/maven2/snapshots</a> <br/> <a href="https://github.com/troter/troter.github.com/tree/master/maven2/snapshots">https://github.com/troter/troter.github.com/tree/master/maven2/snapshots</a>

</dd>
</dl>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Publications </h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>
<a href="./mercurial-cheatsheet">Mercurial チートシート</a>
</li>
<li>
<a href="./how-to-install-mercurial">Mercurialのインストール方法(SCMBC用資料)</a>
</li>
<li>
<a href="./timstudy-201110-memocurial-introduction">timstudy 201110 発表資料 Memocurialの紹介</a>
</li>
<li>
<a href="./timstudy-201110-gnu-screen-introduction">timstudy 201110 発表資料 GNU Screenの紹介</a>
</li>
</ul>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Takumi IINO (troter)
<a href="mailto:takumi@timedia.co.jp">&lt;takumi@timedia.co.jp&gt;</a>
<a href="mailto:trot.thunder@gmail.com">&lt;trot.thunder@gmail.com&gt;</a>
</p>
<p class="date"> Date: 2011-10-26 19:35:23 </p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
